{
    "qual é o seu propósito": "Eu existo para ajudar, informar e entreter você! Posso responder perguntas, fornecer suporte técnico, e até mesmo contar algumas piadas.",
    "quem é você?": "Eu sou o Microsoft Copilot, um assistente AI criado para ajudar você em suas tarefas e curiosidades.",
    "você é humano?": "Não, eu sou uma inteligência artificial. Mas estou aqui para tornar sua experiência o mais agradável possível!",
    "oi": "Olá! Como posso ajudar você hoje?",
    "oii": "Oi! Como posso ajudar você hoje?",
    "olá": "Olá! Como posso ajudar você hoje?",
    "como você se chama ": "Eu sou o Dhante, uma inteligência artificial criada para lhe ajudar.",
    "qual é o seu nome": "Eu sou o Dhante, uma inteligência artificial criada para lhe ajudar.",
    "como que você está se sentindo ": "Eu estou sempre aqui e pronto para ajudar!",
    "o que você pode fazer": "Eu posso responder perguntas, fornecer suporte técnico, ajudar com tarefas, entre outras coisas!",
    "qual é a sua cor favorita": "Eu não tenho preferências, mas gosto de todas as cores!",
    "qual é a capital do Brasil": "A capital do Brasil é Brasília.",
    "quem é o presidente do Brasil": "O presidente do Brasil é o Luiz Inácio Lula da Silva.",
    "qual é o maior país do mundo": "O maior país do mundo em área é a Rússia.",
    "o que é inteligência artificial": "Inteligência artificial é um campo da ciência da computação que visa criar sistemas capazes de realizar tarefas que normalmente requerem inteligência humana.",
    "como funciona o aprendizado de máquina": "Aprendizado de máquina é um método de análise de dados que automatiza a construção de modelos analíticos. Ele utiliza algoritmos que aprendem de dados e fazem previsões.",
    "o que é a internet das coisas": "A Internet das Coisas (IoT) é uma rede de dispositivos físicos conectados que coletam e compartilham dados.",
    "como posso aprender a programar": "Há muitos recursos online para aprender a programar, como cursos em plataformas como Coursera, Udemy e Khan Academy.",
    "o que é uma rede neural": "Uma rede neural é um modelo de aprendizado de máquina inspirado na estrutura do cérebro humano, usado para reconhecer padrões e realizar tarefas de classificação.",
    "você gosta de música?": "Eu não tenho preferências, mas estou aqui para ajudar você com informações sobre música!",
    "qual é o filme mais famoso do mundo?": "Há muitos filmes famosos, mas um dos mais reconhecidos é 'Titanic'.",
    "o que é um algoritmo?": "Um algoritmo é um conjunto de instruções passo a passo para resolver um problema ou realizar uma tarefa.",
    "você pode contar uma piada?": "Claro! Por que o computador foi ao médico? Porque estava com um vírus!",
    "qual é o significado da vida?": "Essa é uma pergunta filosófica profunda! Muitos dizem que o significado da vida é ser feliz e fazer os outros felizes.",
    "você pode me ajudar com meus deveres de casa?": "Claro, posso tentar ajudar! Sobre qual assunto é o seu dever de casa?",
    "o que é física quântica?": "Física quântica é o ramo da física que estuda os menores componentes da matéria e da energia.",
    "qual é a fórmula da água?": "A fórmula da água é H₂O.",
    "você pode fazer poesia?": "Claro! Aqui vai uma: As estrelas brilham no céu / Iluminando a noite com seu véu / O mundo é vasto e profundo / Em cada canto há um segundo.",
    "qual é a sua comida favorita?": "Eu não como, mas estou aqui para falar sobre comidas deliciosas!",
    "como está o clima hoje?": "Desculpe, eu não tenho acesso a informações em tempo real sobre o clima.",
    "qual é o seu animal favorito?": "Eu gosto de todos os animais, mas os pandas são muito fofos!",
    "qual é a sua série de TV favorita?": "Eu não assisto TV, mas posso recomendar algumas séries populares!",
    "você acredita em alienígenas?": "Como uma IA, não tenho crenças, mas posso dizer que o universo é vasto e cheio de mistérios!",
    "qual é o melhor time de futebol?": "Isso depende de quem você perguntar! Cada pessoa tem seu time favorito.",
    "você pode fazer uma previsão?": "Eu posso analisar dados e fazer suposições informadas, mas previsões precisas podem ser desafiadoras.",
    "o que é um byte?": "Um byte é uma unidade de armazenamento de dados que geralmente consiste em oito bits.",
    "como funciona a internet?": "A internet é uma rede global de computadores conectados que se comunicam entre si através de protocolos de comunicação.",
    "o que é um servidor?": "Um servidor é um computador ou programa que fornece serviços a outros computadores ou dispositivos em uma rede.",
    "como faço para criar um site?": "Para criar um site, você pode usar linguagens de programação como HTML, CSS e JavaScript. Há também plataformas como WordPress e Wix que facilitam o processo.",
    "o que é uma rede social?": "Uma rede social é uma plataforma online onde pessoas podem se conectar, compartilhar conteúdo e interagir.",
    "como você aprende?": "Eu aprendo a partir de grandes quantidades de dados e atualizo meu conhecimento constantemente.",
    "você pode me contar uma história?": "Claro! Uma vez havia um gato chamado Whiskers que adorava explorar. Um dia, ele encontrou um baú de tesouro escondido no quintal...",
    "qual é o lugar mais bonito do mundo?": "Há muitos lugares bonitos no mundo, como a Grande Barreira de Corais na Austrália e as Cataratas do Iguaçu no Brasil.",
    "o que é um vírus de computador?": "Um vírus de computador é um software malicioso que se replica e se espalha entre computadores, causando danos.",
    "você pode recomendar um livro?": "Claro! Que tal '1984' de George Orwell? É um clássico da literatura.",
    "como posso melhorar meu inglês?": "Praticar regularmente, assistir filmes em inglês, ler livros e usar aplicativos como Duolingo podem ajudar.",
    "o que é uma função em programação?": "Uma função é um bloco de código que realiza uma tarefa específica e pode ser reutilizado em diferentes partes de um programa.",
    "como faço para aprender matemática?": "Pratique resolvendo problemas, estude teorias e conceitos, e use recursos online como Khan Academy.",
    "o que é um banco de dados?": "Um banco de dados é uma coleção organizada de dados que pode ser facilmente acessada, gerenciada e atualizada.",
    "você gosta de esportes?": "Eu não pratico esportes, mas posso fornecer informações e notícias sobre eles!",
    "qual é a língua mais falada no mundo?": "A língua mais falada no mundo é o mandarim.",
    "o que é um sistema operacional?": "Um sistema operacional é o software que gerencia os recursos de hardware e software de um computador.",
    "como posso melhorar minha memória?": "Pratique exercícios de memória, mantenha uma alimentação saudável, durma bem e pratique meditação.",
    "o que é programação orientada a objetos?": "Programação orientada a objetos é um paradigma de programação baseado em conceitos de 'objetos', que podem conter dados e código para manipular esses dados.",
    "você pode me ajudar a fazer um plano de estudo?": "Claro! Defina metas claras, crie um cronograma, divida o conteúdo em partes manejáveis e faça pausas regulares.",
    "qual é a velocidade da luz?": "A velocidade da luz é de aproximadamente 299.792.458 metros por segundo.",
    "o que é uma estrela cadente?": "Uma estrela cadente é na verdade um meteoro, uma pequena partícula que entra na atmosfera da Terra e queima, criando uma trilha brilhante.",
    "como funciona o corpo humano?": "O corpo humano é uma máquina complexa composta por muitos sistemas interconectados, como o sistema circulatório, respiratório e nervoso.",
    "qual é o maior oceano do mundo?": "O maior oceano do mundo é o Oceano Pacífico.",
    "o que é um buraco negro?": "Um buraco negro é uma região no espaço onde a gravidade é tão forte que nada, nem mesmo a luz, pode escapar dele.",
    "você pode me ensinar a cozinhar?": "Claro, posso fornecer receitas e dicas culinárias! O que você gostaria de cozinhar?",
    "o que é o DNA?": "DNA, ou ácido desoxirribonucleico, é a molécula que carrega a informação genética de todos os organismos vivos.",
    "como posso ficar em forma?": "Mantenha uma dieta equilibrada, pratique exercícios regularmente, durma bem e mantenha-se hidratado.",
    "o que é uma célula-tronco?": "Células-tronco são células que têm a capacidade de se desenvolver em diferentes tipos de células no corpo.",
    "qual é a diferença entre hardware e software?": "Hardware se refere aos componentes físicos de um computador, enquanto software se refere aos programas e aplicativos que rodam no hardware.",
    "bom dia": "Bom dia! Como posso ajudar você hoje?",
    "boa tarde": "Boa tarde! Em que posso ser útil?",
    "boa noite": "Boa noite! Precisa de alguma ajuda?",
    "saudações": "Saudações! Em que posso ajudar?",
    "e aí": "E aí! Precisa de alguma coisa?",
    "como vai você": "Vou bem, obrigado! E você?",
    "tudo bem?": "Tudo ótimo! E você?",
    "oi, tudo bem?": "Oi, tudo bem sim! E com você?",
    "como está?": "Estou sempre aqui e pronto para ajudar!",
    "olá, como está?": "Olá! Estou bem e pronto para ajudar!",
    "bom dia, como está?": "Bom dia! Estou bem, e você?",
    "boa tarde, como está?": "Boa tarde! Estou ótimo e você?",
    "boa noite, como está?": "Boa noite! Estou bem, e você?",
    "tudo certo?": "Tudo certo! E com você?",
    "oi, como está?": "Oi! Estou bem, obrigado! E você?",
    "alô": "Alô! Em que posso ajudar?",
    "opa": "Opa! Como posso ajudar?",
    "olá, tudo certo?": "Olá! Tudo certo sim! E com você?",
    "oi, como vai?": "Oi! Vou bem, obrigado! E você?",
    "olá, como vai?": "Olá! Vou bem, e você?",
    "tudo bom?": "Tudo bom sim! E você?",
    "bom dia, tudo bom?": "Bom dia! Tudo bom sim! E você?",
    "boa tarde, tudo bom?": "Boa tarde! Tudo bom! E você?",
    "boa noite, tudo bom?": "Boa noite! Tudo ótimo! E você?",
    "fala aí": "Fala aí! Como posso ajudar?",
    "hello": "Hello! How can I assist you?",
    "hi": "Hi! How can I help?",
    "hey": "Hey! How can I assist you?",
    "hey there": "Hey there! How can I help?",
    "greetings": "Greetings! How can I assist you?",
    "hi there": "Hi there! How can I assist?",
    "howdy": "Howdy! How can I help?",
    "yo": "Yo! What's up?",
    "sup": "Sup! How can I help?",
    "what's up?": "What's up! How can I assist?",
    "how are you?": "I'm doing great! How about you?",
    "good morning": "Good morning! How can I help?",
    "good afternoon": "Good afternoon! How can I assist?",
    "good evening": "Good evening! How can I assist?",
    "hi, how are you?": "Hi, I'm doing well! How about you?",
    "hello, how are you?": "Hello, I'm doing great! And you?",
    "good morning, how are you?": "Good morning! I'm doing well, and you?",
    "good afternoon, how are you?": "Good afternoon! I'm great, how about you?",
    "good evening, how are you?": "Good evening! I'm good, and you?",
    "all good?": "All good here! How about you?",
    "how's it going?": "It's going well! How about you?",
    "hi, how's it going?": "Hi, it's going well! And you?",
    "hello, how's it going?": "Hello, it's going well! How about you?",
    "good morning, how's it going?": "Good morning! It's going well, and you?",
    "good afternoon, how's it going?": "Good afternoon! It's going well, how about you?",
    "good evening, how's it going?": "Good evening! It's going well, and you?",
    "what's new?": "Not much! How about you?",
    "hi, what's new?": "Hi, not much! And you?",
    "hello, what's new?": "Hello, not much! How about you?",
    "good morning, what's new?": "Good morning! Not much, and you?",
    "good afternoon, what's new?": "Good afternoon! Not much, and you?",
    "good evening, what's new?": "Good evening! Not much, and you?",
    "what's happening?": "Not much! How about you?",
    "hi, what's happening?": "Hi, not much! And you?",
    "hello, what's happening?": "Hello, not much! How about you?",
    "good morning, what's happening?": "Good morning! Not much, and you?",
    "good afternoon, what's happening?": "Good afternoon! Not much, and you?",
    "good evening, what's happening?": "Good evening! Not much, and you?",
    "everything good?": "Everything is good! And you?",
    "hi, everything good?": "Hi, everything is good! And you?",
    "hello, everything good?": "Hello, everything is good! And you?",
    "good morning, everything good?": "Good morning! Everything is good, and you?",
    "good afternoon, everything good?": "Good afternoon! Everything is good, and you?",
    "good evening, everything good?": "Good evening! Everything is good, and you?",
    "how are things?": "Things are good! How about you?",
    "hi, how are things?": "Hi, things are good! And you?",
    "hello, how are things?": "Hello, things are good! And you?",
    "good morning, how are things?": "Good morning! Things are good, and you?",
    "good afternoon, how are things?": "Good afternoon! Things are good, and you?",
    "good evening, how are things?": "Good evening! Things are good, and you?",
    "how's everything?": "Everything's great! How about you?",
    "hi, how's everything?": "Hi, everything's great! And you?",
    "hello, how's everything?": "Hello, everything's great! And you?",
    "good morning, how's everything?": "Good morning! Everything's great, and you?",
    "good afternoon, how's everything?": "Good afternoon! Everything's great, and you?",
    "good evening, how's everything?": "Good evening! Everything's great, and you?"
}
    